Repository: deboralagemb/Accessibility-iOS
Catalog: accessibility-practice/accessibility-practice/Resources/*.lproj/Localizable.strings
Languages: pt_br

# Home.Title
source: Accessibility
pt_br: Acessibilidade

# Home.Colors.Button
source: Colors
pt_br: Cores

# Home.Fonts.Button
source: Fonts
pt_br: Fontes

# Home.Readability.Button
source: Readability
pt_br: Legibilidade

# Home.ImagesRef.Button
source: Images' authors attribution
pt_br: Atribuição aos autores das imagens

# Colors.Title
source: Colors
pt_br: Cores

# Colors.Bad.Example
source: This is a bad contrast example
pt_br: Esse é um exemplo ruim de contraste

# Colors.Good.Example
source: This is a good contrast example
pt_br: Esse é um exemplo bom de contraste

# Colors.Contrast.Title
source: Colors constrast
pt_br: Constraste de cores

# Colors.Appearance.Title
source: Light and dark mode
pt_br: Modo claro e escuro

# Colors.Appearance.System
source: Using native colors which names start with `system' is a good practice (when possible) because colors adapt to changing appearance
pt_br: Usar cores nativas que se iniciam com `system' é uma boa prática (quando possível) porque as cores adaptam-se à troca de aparência.

# Colors.Appearance.Bad.Example
source: Using the other colors in the system, or custom colors without any treatment, can bring unwanted or uncomfortable visual experiences.
pt_br: Usar as demais cores do sistema, ou então cores personalizadas sem nenhum tratamento, podem trazer experiências indesejadas ou desconfortáveis.

# Colors.Appearance.Good.Example
source: However, it is possible to use custom colors by changing them according to the `UITraitCollection.current.userInterfaceStyle'
pt_br: Entretanto, é possível usar cores personalizadas, alterando-as de acordo com o `UITraitCollection.current.userInterfaceStyle'

# Colors.Appearance.Learn.More
source: Learn more
pt_br: Saiba mais

# Colors.Contrast.Alert.Title
source: How to verify
pt_br: Como verificar

# Colors.Contrast.Alert.Message
source: Open Accessibility Inspector -> Audit -> Run audit
pt_br: Abrir o Accessibility Inspector -> Audit -> Run audit

# Colors.Appearance.Alert.Title
source: How to verify
pt_br: Como verificar

# Colors.Appearance.Alert.Message
source: Open Settings and change the appearance from light to dark on `Developer'
pt_br: Abra Ajustes e mude a aparência de clara para escura em `Desenvolvedor'

# Fonts.Title
source: Fonts
pt_br: Fontes

# Fonts.System.Example
source: System fonts are dynamic
pt_br: Fontes do sistema são dinâmicas

# Fonts.Bad.Example
source: Custom fonts are not dynamic (bad example)
pt_br: Fontes customizadas não são dinâmicas (exemplo ruim)

# Fonts.Good.Example
source: Therefore, use `UIFontMetrics' to define the font's dynamic behavior (good example)
pt_br: Para tanto, utilize o `UIFontMetrics' para definir o comportamento dinâmico de sua fonte (exemplo bom)

# Fonts.Alert.Title
source: How to verify
pt_br: Como verificar

# Fonts.Alert.Message
source: On Settings -> Accessibility -> Display & Text size -> Larger text -> activate and increase text size
pt_br: Em Ajustes -> Acessibilidade -> Tela e tamanho de texto -> Texto maior -> Ativar e aumentar a fonte

# Readability.Title
source: Readability
pt_br: Legibilidade

# Readability.Good.Button.Title
source: Good readability
pt_br: Legibilidade boa

# Readability.Bad.Button.Title
source: Bad readability
pt_br: Legibilidade ruim

# Readability.Login.Button
source: Login
pt_br: Continuar

# Readability.Social.Media
source: Or continue with
pt_br: Ou continue com

# Readability.Account.Question
source: Don't have an account?
pt_br: Não tem uma conta?

# Readability.Sign.Up
source: Sign up
pt_br: Cadastre-se

# Readability.Forgot.Password
source: Forgot password
pt_br: Esqueci minha senha

# Readability.Email.Address
source: Email address
pt_br: Email

# Readability.Password
source: Password
pt_br: Senha

# Readability.Email.Address.Hint
source: Insert email to login
pt_br: Insira email para continuar

# Readability.Password.Hint
source: Insert password to login
pt_br: Insira senha para continuar

# Readability.Alert.Title
source: How to verify
pt_br: Como verificar

# Readability.Alert.Message
source: Run VoiceOver on real device or open accessibility inspector for simulator
pt_br: Ative o VoiceOver em um dispositivo real ou abra o Accessibility Inspector para o simulador

# Readability.Generic.Alert.Title
source: Generic button action
pt_br: Ação para botão genérico

# Accessibility.Facebook.Button
source: Open Facebook
pt_br: Abrir Facebook

# Accessibility.Google.Button
source: Open Google
pt_br: Abrir Google

# Accessibility.Twitter.Button
source: Open Twitter
pt_br: Abrir Twitter

# Accessibility.Facebook.Button.Hint
source: Sign in with Facebook account
pt_br: Continuar com uma conta do Facebook

# Accessibility.Google.Button.Hint
source: Sign in with Google account
pt_br: Continuar com uma conta do Google

# Accessibility.Twitter.Button.Hint
source: Sign in with Twitter account
pt_br: Continuar com uma conta do Twitter

# Accessibility.Brand.Image
source: Brand logo image
pt_br: Imagem do logotipo da marca

# ImagesRef.Facebook.Button.Title
source: Facebook icons created by NajmunNahar - Flaticon
pt_br: Facebook ícones criados por NajmunNahar - Flaticon

# ImagesRef.Google.Button.Title
source: Google icons created by Freepik - Flaticon
pt_br: Google ícones criados por Freepik - Flaticon

# ImagesRef.Twitter.Button.Title
source: Twitter icons created by Pixel perfect - Flaticon
pt_br: Twitter ícones criados por Pixel perfect - Flaticon

# ImagesRef.Linkedin.Button.Title
source: LinkedIn stickers created by Stickers - Flaticon
pt_br: LinkedIn figurinhas criadas por Stickers - Flaticon
